Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We use `attribute-mappings` to bind the `SELECT` projection fields (i.e. `u.role` here) to the target Principal representation attributes.
ja_jp: `attribute-mappings` を使用して、 `SELECT` の射影フィールド(例:ここでは `u.role` )をターゲットの Principal 表現の属性にバインドしています。

source: We use `attribute-mappings` to bind the `SELECT` projection fields (ie. `u.role` here) to the target Principal representation attributes.
ja_jp: `attribute-mappings` を使用して、 `SELECT` の投影フィールド(例:ここでは `u.role` )をターゲットの Principal 表現属性にバインドしています。

source: We use `installMockForInstance` to replace the injected bean, this takes effect for the duration of the test method.
ja_jp: 私たちは `installMockForInstance` を使用して注入されたBeanを置き換えます。

source: We use `toNdJsonString(entityList)` call to produce output like below
ja_jp: `toNdJsonString(entityList)` を使用して、以下のような出力を生成します。

source: We use a `@FullTextField` similar to what we did for `Author` but you'll notice that the analyzer is different - more on this later.
ja_jp: `Author` の場合と同様に `@FullTextField` を使用しますが、アナライザーが異なることに気付くでしょう。これについては後で詳しく説明します。

source: We use a `@FullTextField` similar to what we did for `Book` but you'll notice that the analyzer is different - more on this later.
ja_jp: `@FullTextField` は `Book` と同様のものを使用しますが、アナライザーが異なることに気がつくでしょう - これについては後で説明します。

source: We use a profile because, you will see very soon, packaging the native executable takes a _few_ minutes. You could just pass -Dquarkus.native.enabled=true as a property on the command line, however it is better to use a profile as this allows native image tests to also be run.
ja_jp: すぐにわかると思いますが、ネイティブ実行可能ファイルのパッケージ化には _数分_ かかるため、プロファイルを使用しています。 コマンドラインでプロパティーとして -Dquarkus.native.enabled=true を渡すこともできますが、プロファイルを使用するとネイティブイメージテストも実行できるようになるため、プロファイルを使用することをお勧めします。

source: We use a profile because, you will see very soon, packaging the native executable takes a _few_ minutes. You could just pass -Dquarkus.package.type=native as a property on the command line, however it is better to use a profile as this allows native image tests to also be run.
ja_jp: プロファイルを使用しているのは、すぐにわかると思いますが、ネイティブ実行可能ファイルをパッケージ化するのに _数_ 分かかるからです。コマンドラインのプロパティーとして -Dquarkus.package.type=native を渡すだけでもいいのですが、プロファイルを使う方がいいでしょう。

source: We use attributes in our cross-references to ensure our docs can be built across these environments.
ja_jp: クロスリファレンスで属性を使用することで、これらの環境でドキュメントを構築できるようになります。

source: We use constructor injection to receive the managed Vert.x instance. Field injection works too.
ja_jp: コンストラクタ・インジェクションを使用して、マネージドVert.xインスタンスを受け取ります。フィールド・インジェクションも有効です。

source: We use public fields here, but you can use private fields and getters/setters if you prefer.
ja_jp: ここではパブリックフィールドを使用していますが、必要に応じてプライベートフィールドやゲッター/セッターを使用することもできます。

source: We use the Font Awesome Free icon set.
ja_jp: Font Awesome Freeアイコンセットを使用しています。

source: We use the Vert.x file system API to read the created file
ja_jp: Vert.xのファイルシステムAPIを使用して、作成されたファイルを読み取ります。

source: We use the `.properties` suffix in our example because most IDEs and text editors support syntax highlighting of `.properties` files. But in fact, the suffix could be anything - it is just ignored.
ja_jp: この例では `.properties` という接尾辞を使用していますが、これはほとんどの IDE やテキストエディターが `.properties` ファイルのシンタックスハイライトをサポートしているからです。しかし、実際には接尾辞は何でもよいため、単に無視されます。

source: We use the `mp.messaging.incoming.movies-in` prefix to configure the channel. The `connector` attribute indicates who's responsible for this channel, here the AMQP connector. We also need to specify the consumed destination using the `address` attribute.
ja_jp: チャンネルの設定には、 `mp.messaging.incoming.movies-in` というプレフィックスを使用します。 `connector` 属性は、このチャネルの責任者(ここでは AMQP コネクタ)を示します。また、 `address` 属性を使用して、消費先を指定する必要があります。

source: We use the `mp.messaging.incoming.movies-in` prefix to configure the channel. The `connector` attribute indicates who's responsible for this channel, here the Kafka connector. We also need to configure the key and value deserializers.
ja_jp: `mp.messaging.incoming.movies-in` というプレフィックスを使ってチャネルを設定します。 `connector` 属性は、このチャネルを担当するコネクタ (ここでは Kafka コネクタ) を示しています。また、キーと値のデシリアライザも設定する必要があります。

source: We use the `request` method to initiate the request-reply interaction. We send the name to the "greetings" address.
ja_jp: `request` メソッドを使用して、リクエストとリプライのやりとりを開始します。名前を "greetings "アドレスに送信します。

source: We use the `rest-jackson` extension here and not the JSON-B variant because we will use the Vert.x `JsonObject` helper to serialize/deserialize our objects to/from Elasticsearch and it uses Jackson under the hood.
ja_jp: ここでは、JSON-Bではなく、 `rest-jackson` エクステンションを使用しています。これは、Elasticsearch との間でオブジェクトをシリアライズ/デシリアライズするために Vert.x `JsonObject` ヘルパーを使用し、内部的に Jackson を使用しているためです。

source: We use the `resteasy-jackson` extension here and not the JSON-B variant because we will use the Vert.x `JsonObject` helper to serialize/deserialize our objects to/from Elasticsearch and it uses Jackson under the hood.
ja_jp: ここでは JSON-B などではなく `resteasy-jackson` エクステンションを使用しています。これは Vert.x `JsonObject` ヘルパーを使用して Elasticsearch との間でオブジェクトをシリアライズ/デシリアライズし、Jackson を使用するからです。

source: We use the `resteasy-reactive-jackson` extension here and not the JSON-B variant because we will use the Vert.x `JsonObject` helper to serialize/deserialize our objects to/from Elasticsearch and it uses Jackson under the hood.
ja_jp: ここでは JSON-B などではなく `resteasy-jackson` エクステンションを使用しています。これは Vert.x `JsonObject` ヘルパーを使用して Elasticsearch との間でオブジェクトをシリアライズ/デシリアライズし、Jackson を使用するからです。

source: We use the default datasource here, but could use a named datasource if we wanted to, by following instructions <<multiple-persistence-units,there>>.
ja_jp: ここではデフォルトのデータソースを使用していますが、<<multiple-persistence-units,there>> の指示に従って、名前付きのデータソースを使用することもできます。

source: We use:
ja_jp: 以下のものを使用しています:

source: We used Fernflower for that until now but we have switched to Quiltflower which provides a better output.
ja_jp: 今まではFernflowerを使っていましたが、より良い出力が得られるQuiltflowerに切り替えました。

source: We value your feedback a lot so please report bugs, ask for improvements... Let's build something great together!
ja_jp: 私達は皆様からのフィードバックに重きを置いています。バグ報告、改善要望を是非お願いします。一緒に素晴らしいものを作り上げていきましょう!

source: We value your feedback a lot, so please report bugs, and ask for improvements... Let's build something great together!
ja_jp: 私達は皆様からのフィードバックに重きを置いています。バグ報告、改善要望を是非お願いします。一緒に素晴らしいものを作り上げていきましょう!

source: We verify the application has a `greeting` endpoint responding to a HTTP GET request with a OK status (200) and a plain text body containing `Hello`
ja_jp: アプリケーションが `greeting` エンドポイントから OK ステータス (200) の HTTP GET 要求に応答していることと、 `Hello` を含むプレーンテキスト本文があることを確認します。

source: We verify the application has a `greeting` endpoint responding to an HTTP GET request with an OK status (200) and a plain text body containing `Hello`
ja_jp: アプリケーションが `greeting` エンドポイントから OK ステータス (200) で HTTP GET 要求に応答していることと、 `Hello` を含むプレーンテキスト本文があることを確認します。

source: We want to let the readers of our tutorial know what they will achieve by following the steps in the tutorial. This abstract should be concise and should use appropriate verbs (create, build, deploy, ...) to set expectations. They should be able to determine if they want to engage with the content.
ja_jp: チュートリアルの読者に、チュートリアルの手順に従うことで何を達成できるのかを知らせる必要があります。この概要は簡潔である必要があり、適切な動詞 (作成する、ビルドする、デプロイするなど) を使用して期待感を高める必要があります。これにより、読者はチュートリアルのコンテンツに興味があるかないかを判断できるはずです。

source: We want to make the migration to Quarkus 3 seamless for our users. With that in mind, we have created a <a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0">migration guide</a> as well as tooling to facilitate this process.
ja_jp: 私達は、ユーザーにとってQuarkus 3への移行がシームレスであることを望んでいます。このことを念頭に、<a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0">移行ガイド</a>と、このプロセスを促進するためのツールを作成しました。

source: We want to pass the `MediaLibrary` instance to the `LibraryPermission` constructor.
ja_jp: `MediaLibrary` インスタンスを `LibraryPermission` コンストラクターに渡します。

source: We wanted enabling Leyden in Quarkus to be a one-flag operation.
ja_jp: 私たちは、Quarkus で Leyden を有効にするのが、1 つのフラグで済む操作であることを望みました。

source: We wanted training to be as seamless as possible for Quarkus users. The natural fit was to leverage the existing integration test infrastructure: if you already have `@QuarkusIntegrationTest` tests, they can serve as the training workload.
ja_jp: 私たちは、Quarkus ユーザーにとってトレーニングが可能な限りシームレスであることを望みました。既存の統合テストインフラストラクチャーを活用するのが自然な選択でした。つまり、すでに `@QuarkusIntegrationTest` テストがある場合、それらをトレーニングワークロードとして利用できます。

source: We welcome contributions, feedback, and real-world usage reports! If you're building AI agents or want to explore multi-agent architectures, the A2A Java SDK provides a solid foundation.
ja_jp: 貢献、フィードバック、実世界の利用状況レポートを歓迎します。AI エージェントを構築している方や、マルチエージェントアーキテクチャを検討している方にとって、A2A Java SDK は堅牢な基盤を提供します。

source: We welcome your feedback on the Quarkus documentation style guidelines.
ja_jp: Quarkusのドキュメントスタイルガイドラインに関するご意見をお待ちしております。

source: We were hard at work to ensure compatibility and avoid as many warnings as possible when running Quarkus applications on Java 25. If you encounter any issues, including warnings that shouldn't be there, please report them on our https://github.com/quarkusio/quarkus/issues[bug tracker].
ja_jp: Java 25でQuarkusアプリケーションを実行する際の互換性を確保し、可能な限り多くの警告を回避するために懸命に取り組みました。そこに表示されるべきではない警告を含む問題に遭遇した場合は、 link:https://github.com/quarkusio/quarkus/issues[バグトラッカー] に報告してください。

source: We were using a very old version of the Microsoft SQL Server JDBC driver, due to some issues when compiling to native executables. We were finally able to upgrade to version 11.2.0.jre11 in Quarkus 2.12.0.Final.
ja_jp: ネイティブ実行可能ファイルにコンパイルする際にいくつかの問題が発生したため、Microsoft SQL Server JDBCドライバの非常に古いバージョンを使用していました。Quarkus 2.12.0.Finalでようやくバージョン11.2.0.jre11にアップグレードすることができました。

source: We will author a DMN model that will provide a base price quotation based on some criteria. Create a new file `pricing.dmn` inside the `src/main/resources/` directory of the generated project.
ja_jp: いくつかの基準に基づいて基本的な価格の見積もりを提供するDMNモデルを作成します。生成されたプロジェクトの `src/main/resources/` ディレクトリ内に、新しいファイル `pricing.dmn` を作成します。

source: We will be asking the NVD CPE team to update the list as well as link Quarkus CPE name entries with the related CVEs on a regular basis. If you work with the link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency Check Plugin] which is using NVD feeds to detect the vulnerabilities at the application build time and see a false positive reported then please re-open link:https://github.com/quarkusio/quarkus/issues/2611[this issue] and provide the details.
ja_jp: NVD CPEチームには、リストの更新と、Quarkus CPE名エントリと関連するCVEとのリンクを定期的に更新するよう依頼する予定です。アプリケーションのビルド時に脆弱性を検出するためにNVDのフィードを使用している link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency Check Plugin] を使用していて、誤検出が報告された場合は、 link:https://github.com/quarkusio/quarkus/issues/2611[このIssue] を再度オープンして詳細をお知らせください。

source: We will build the Final artifacts on June 23rd so keep the feedback coming!
ja_jp: 6月23日に最終アーティファクトを作成しますので、フィードバックをお待ちしています。

source: We will call the services using the REST Client. Create the `src/main/java/org/acme/MyService.java` file with the following content:
ja_jp: REST Clientを使ってサービスを呼び出します。 以下の内容で `src/main/java/org/acme/MyService.java` ファイルを作成します：

source: We will call the services using the Reactive REST Client. Create the `src/main/java/org/acme/MyService.java` file with the following content:
ja_jp: Reactive REST Clientを使ってサービスを呼び出すことにします。以下の内容で `src/main/java/org/acme/MyService.java` ファイルを作成します。

source: We will cover the most often asked questions we have seen and any question tagged with `#quarkusinsights` on our various social media presences: https://twitter.com/search?q=%23quarkusinsights[Twitter], https://www.facebook.com/hashtag/quarkusinsights/[Facebook] or https://www.linkedin.com/search/results/content/?keywords=%23quarkusinsights&origin=GLOBAL_SEARCH_HEADER[LinkedIn].
ja_jp: 私たちは、これまでによく見られた質問や、私たちの様々なソーシャルメディア link:https://twitter.com/search?q=%23quarkusinsights[Twitter]、 link:https://www.facebook.com/hashtag/quarkusinsights/[Facebook]、 https://www.linkedin.com/search/results/content/?keywords=%23quarkusinsights&origin=GLOBAL_SEARCH_HEADER[LinkedIn] 上で `#quarkusinsights` とタグ付けされた質問を取り上げます。

source: We will cover the most often asked questions we have seen and any question tagged with `#quarkusinsights` on our various social media presences: https://twitter.com/search?q=%23quarkusinsights[Twitter], https://www.facebook.com/hashtag/quarkusinsights/[Facebook], https://www.linkedin.com/search/results/content/?keywords=%23quarkusinsights&origin=GLOBAL_SEARCH_HEADER[LinkedIn] or on the https://www.youtube.com/watch?v=OV-ZnvHoQIk[youtube event] directly.
ja_jp: 私たちは、私たちが見てきた最も頻繁に質問された質問や、私たちの様々なソーシャルメディアで `#quarkusinsights` とタグ付けされた任意の質問をカバーします( link:https://twitter.com/search?q=%23quarkusinsights[Twitter] 、 link:https://www.facebook.com/hashtag/quarkusinsights/[Facebook] 、 link:https://www.linkedin.com/search/results/content/?keywords=%23quarkusinsights&origin=GLOBAL_SEARCH_HEADER[LinkedIn] 、または link:https://www.youtube.com/watch?v=OV-ZnvHoQIk[youtubeイベント] で直接)。

source: We will create a `Fruit` bean and a `FruitResource` REST resource (feel free to take a look to the xref:rest-json.adoc[Writing JSON REST services guide] if your want more details on how to build a REST API with Quarkus).
ja_jp: ここでは、 `Fruit` Beanと `FruitResouce` RESTリソースを作成します（QuarkusでREST APIを構築する方法について詳しく知りたい場合は、 link:rest-json.html[Writing JSON REST servicesガイド]を参照してください）。

source: We will create a simple test to ensure that this is being served correctly:
ja_jp: これが正しく提供されているかどうかを確認するための簡単なテストを作成します:

source: We will create another health check procedure that simulates a connection to an external service provider such as a database. For starters, we will always return the response indicating the application is ready.
ja_jp: ここでは、データベースなどの外部サービスプロバイダへの接続をシミュレートする別のヘルスチェックプロシージャを作成します。まずは、アプリケーションの準備ができていることを示すレスポンスを常に返すようにします。

source: We will define a Drools Rule Unit and the rules in the DRL format.
ja_jp: Drools ルールユニットとルールを DRL 形式で定義します。

source: We will deploy a web application so we need to configure the type `web` in the Heroku `Procfile` like this:
ja_jp: 今回はWebアプリケーションをデプロイするので、Heroku `Procfile` でタイプ `web` を以下のように設定する必要があります。

source: We will drop and recreate the schema every time we start the application.
ja_jp: アプリケーションを起動するたびにスキーマをドロップして再作成することになります。

source: We will eventually provide an extension for the new Open Source Java client but it will require changes in your applications as it is an entirely new client.
ja_jp: 最終的には、新しいオープンソースJavaクライアント用のエクステンションを提供する予定ですが、まったく新しいクライアントであるため、アプリケーションの変更が必要になります。

source: We will eventually provide an extension for the new Open Source Java client, but it will require changes in your applications as it is an entirely new client.
ja_jp: 最終的には、新しいオープンソースのJavaクライアント用のエクステンションを提供する予定ですが、全く新しいクライアントであるため、アプリケーションの変更が必要になります。

source: We will expose `Fruit` instances over HTTP in the JSON format. Consequently, you also need to add the `quarkus-resteasy-jackson` extension:
ja_jp: JSON 形式で HTTP 経由で `Fruit` インスタンスを公開します。そのため、 `quarkus-resteasy-jackson` のエクステンションも追加する必要があります。

source: We will expose `Fruit` instances over HTTP in the JSON format. Consequently, you also need to add the `quarkus-resteasy-reactive-jackson` extension:
ja_jp: JSON 形式で HTTP 経由で `Fruit` インスタンスを公開します。そのため、 `quarkus-resteasy-reactive-jackson` のエクステンションも追加する必要があります。

source: We will expose `Fruit` instances over HTTP in the JSON format. Consequently, you must also add the `quarkus-rest-jackson` extension:
ja_jp: `Fruit` インスタンスを HTTP 経由で JSON 形式で公開します。 したがって、 `quarkus-rest-jackson` エクステンションも追加する必要があります。

source: We will give a brief overview of the topic here, please refer to the link:{vthreadjep}[JEP 425] for more information.
ja_jp: ここではその概要を説明しますが、詳細はは link:{vthreadjep}[JEP 425] を確認してください。

source: We will give a brief overview of the topic here; please refer to the link:{vthreadjep}[JEP 425] for more information.
ja_jp: ここでは、このトピックに関する概要を説明しますが、詳細は link:{vthreadjep}[JEP 425] を参照してください。

source: We will keep publishing the deprecated plugin for a while so you it is not urgent to switch to the new one.
ja_jp: 非推奨のプラグインはしばらく公開し続けますので、新しいプラグインへの移行を急がないでください。

source: We will keep the Migration Guide up to date here: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0.
ja_jp: マイグレーションガイドは、こちら: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0 で随時更新していきます。

source: We will need to reference the configurer from the configuration properties, so we make it a named bean.
ja_jp: 設定プロパティからconfigurerを参照する必要があるので、名前付きbeanにします。

source: We will only cover the Java 11 runtime as the Java 8 runtime uses its own Servlet engine which is not compatible with Quarkus.
ja_jp: Java 8 ランタイムはQuarkusと互換性のない独自のサーブレットエンジンを使用しているため、Java 11 ランタイムのみをカバーします。

source: We will soon start a new chapter with Quarkus 2.0.0.Final. It should be released by the end of this month.
ja_jp: もうすぐQuarkus 2.0.0.Finalで新しい章が始まります。今月末にはリリースされる予定です。

source: We will start with an original Vert.x https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] `how-to` tutorial which shows how a https://docs.github.com/en/apps/oauth-apps/building-oauth-apps/authenticating-to-the-rest-api-with-an-oauth-app[GitHub OAuth2 application] can be implemented with Vert.x OIDC. You may have already worked through this tutorial before as a Vert.x OIDC user.
ja_jp: まず、オリジナルの Vert.x https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] `how-to` チュートリアルから始めます。これは、Vert.x OIDC を使用して https://docs.github.com/en/apps/oauth-apps/building-oauth-apps/authenticating-to-the-rest-api-with-an-oauth-app[GitHub OAuth2 アプリケーション] を実装する方法を示しています。Vert.x OIDC ユーザーであれば、すでにこのチュートリアルに取り組んだことがあるかもしれません。

source: We will use a `smallrye.jwt.sign.key.location` property to point to this private signing key.
ja_jp: `smallrye.jwt.sign.key.location` プロパティーを使用して、この秘密署名鍵を指します。

source: We will use http://rest-assured.io[RestAssured] (massively used in Quarkus) to test our HTTP endpoint. Let's add the `rest-assured` dependency into the `./greeting-extension/deployment/pom.xml`.
ja_jp: http://rest-assured.io[RestAssured] (Quarkus で非常によく使われる) を使用して HTTP エンドポイントをテストします。 `rest-assured` の依存関係を `./greeting-extension/deployment/pom.xml` に追加しましょう。

source: We will use https://rest-assured.io[RestAssured] (massively used in Quarkus) to test our HTTP endpoint. Let's add the `rest-assured` dependency into the `./greeting-extension/deployment/pom.xml`.
ja_jp: http://rest-assured.io[RestAssured] (Quarkus で非常によく使われる) を使用して HTTP エンドポイントをテストします。 `rest-assured` の依存関係を `./greeting-extension/deployment/pom.xml` に追加しましょう。

source: We will use the JSR 250 common security annotations, they are described in the xref:security-overview-concept.adoc[Using Security] guide.
ja_jp: JSR 250の共通セキュリティアノテーションを使用します。これらは、 xref:security-overview-concept.adoc[セキュリティの利用] ガイドで説明されています。

source: We will use the JSR 250 common security annotations, they are described in the xref:security-overview.adoc[Using Security] guide.
ja_jp: JSR250の一般的なセキュリティアノテーションを使用します。これらのアノテーションは、 xref:security-overview.adoc[セキュリティの使用] ガイドで説明されています。

source: We will use the JSR 250 common security annotations, they are described in the xref:security.adoc[Using Security] guide.
ja_jp: JSR 250の共通セキュリティアノテーションを使用します。これらは、 xref:security.adoc[セキュリティの利用] ガイドで説明されています。

source: We will use the Java 17 runtime but you can switch to the Java 11 runtime by using `--runtime=java11` instead of `--runtime=java17` on the deploy commands.
ja_jp: ここではJava 17ランタイムを使用しますが、デプロイコマンドで `--runtime=java17` の代わりに `--runtime=java11` を使用することで、Java 11ランタイムに切り替えることが可能です。

source: We will use the Java 17 runtime but you can switch to the Java 21 runtime by using `--runtime=java21` instead of `--runtime=java17` on the deploy commands.
ja_jp: ここではJava 17ランタイムを使用しますが、デプロイ・コマンドで `--runtime=java17` の代わりに `--runtime=java21` を使用することで、Java 21ランタイムに切り替えることができます。

source: We will use the Java 21 runtime but you can switch to the Java 17 runtime by using `--runtime=java17` instead of `--runtime=java21` on the deploy commands.
ja_jp: ここではJava 21ランタイムを使用しますが、デプロイ・コマンドで `--runtime=java21` の代わりに `--runtime=java17` を使用することで、Java 17ランタイムに切り替えることができます。

source: We will use the Java 21 runtime, but you can switch to the Java 17 runtime by using `--runtime=java17` instead of `--runtime=java21` on the deploy commands.
ja_jp: ここではJava 21ランタイムを使用しますが、デプロイ・コマンドで `--runtime=java21` の代わりに `--runtime=java17` を使用することで、Java 17ランタイムに切り替えることができます。

source: We will wire the Rule Unit into a standard Quarkus CDI bean, for use in the Quarkus application (for instance, wiring MQTT messages from Kafka, etc.).
ja_jp: Quarkus アプリケーションで使用するために、Rule Unit を標準の Quarkus CDI Bean に接続します (たとえば、Kafka からの MQTT メッセージの接続など)。

source: We won't drop the images from our community Quay repository but they won't be updated anymore. Which means that CVE issues affecting UBI 8 won't be fixed in the community Quarkus UBI 8 images anymore.
ja_jp: コミュニティの Quay リポジトリーからイメージを削除することはありませんが、それらのイメージは今後更新されません。これは、UBI 8 に影響を与える CVE の問題が、コミュニティ版 Quarkus UBI 8 イメージでは今後修正されないことを意味します。

source: We won't use SSL so we disable it to have a more compact native executable.
ja_jp: SSLは使用しないので無効にして、よりコンパクトなネイティブ実行可能ファイルにします。

source: We won't use SSL, so we disable it to have a more compact native executable.
ja_jp: SSLは使用しないので、ネイティブ実行可能ファイルをよりコンパクトにするために無効にしています。

source: We wrote a new benchmark.
ja_jp: 新しいベンチマークを作成しました。

source: We'll also highlight some configurable non-application endpoints of interest:
ja_jp: また、設定可能なアプリケーション以外のエンドポイントにも注目しています:

source: We'll be using the Quarkus Infinispan Client extension to connect to interact with Infinispan.
ja_jp: Quarkus Infinispan Clientエクステンションを使用して、Infinispanに接続し、対話します。

source: We'll be using the Quarkus Redis Client extension to connect to our Redis Server. The extension is implemented on top of the https://vertx.io/docs/vertx-redis-client/java/[Vert.x Redis Client], providing an asynchronous and non-blocking way to connect to Redis.
ja_jp: 今回は、Quarkus Redis Clientエクステンションを使用して、Redisサーバーに接続します。このエクステンションは link:https://vertx.io/docs/vertx-redis-client/java/[Vert.x Redis Client] の上に実装されており、非同期かつノンブロッキングでRedisに接続する方法を提供します。

source: We'll be using the Quarkus Redis extension to connect to interact with Redis.
ja_jp: Quarkus Redisエクステンションを使用して、Redisと対話型で接続しましょう。

source: We'll do that using a single Quarkus annotation.
ja_jp: これをQuarkusの単一のアノテーションを使用して行います。

source: We'll explore this in more detail in a future blog post, but for now, suffice it to say that Project Leyden caches classes in a loaded and linked state, along with additional metadata such as method profiling information and, soon, compiled code.
ja_jp: これについては今後のブログ投稿で詳しく説明しますが、現時点では、Project Leyden がクラスをロードおよびリンクされた状態でキャッシュし、メソッドのプロファイリング情報や、将来的にはコンパイル済みコードなどの追加メタデータも保持できることを知っておけば十分です。

source: We'll go into more detail in the next blog post, where we'll talk more about Project Leyden itself and how we integrated it into Quarkus. Stay tuned.
ja_jp: 次回のブログ投稿では、Project Leyden 自体と、それをどのように Quarkus に統合したかについて詳しく説明します。お楽しみに。

source: We'll see how to automate those validation in the next and last part of this tutorial.
ja_jp: このチュートリアルの最後となる次のパートでは、これらの検証を自動化する方法を見ていきましょう。

source: We'll see how to automate those validations in the next and last part of this tutorial.
ja_jp: このチュートリアルの最後となる次のパートでは、これらの検証を自動化する方法を見ていきましょう。

source: We'll start with a very simple template:
ja_jp: まずはとてもシンプルなテンプレートから:

source: We'll start with the steps required to create and add an endpoint to a file.
ja_jp: エンドポイントを作成してファイルに追加するために必要な手順から始めます。

source: We'll take care of provisioning a new repository and set it up to:
ja_jp: 我々は、新しいリポジトリのプロビジョニングを行い、以下のように設定します。
